# QG训练营网络组第四周周记：2018年4月30日

## 生活随记
1. 这周开始感受到了生活节奏被打乱的烦恼，每当解决完一件头疼的事情的时候，另一件烦心的事情便随即而来。
2. 我之前想着主次分明地做每一件事，却总是感觉自己只做主要的事情，次要的事情常常被忽略。而又当我想着去权衡地做事情的时候，主要的事情又显得不够时间去实现，纠结的日子一直如此。
3. 这周放弃了日常的锻炼，可是每日还是继续地熬夜，感觉这样做到效率并没有以往的那么高效，反而是更加低下。导致一旦有早课的日子大部分都是在浑水摸鱼。
4. 完成一份任务，尽管内心拥有很多的想法去完善，可是总是在另一件事情的冲撞下选择了忽视。这一点感觉真的十分不好。


## 一周总结
1. 继续深入地学习交互的知识，像是开始接触了以前一直不懂的cookie，缓存等知识，开始了解制作网页上的体现机制的原理，像是验证码还有重定向跟转发等，都感觉使我对网页制作的架构有着更为深明的理解。  
2.  开始学习EL表达式和JSTL标签库的知识，感觉这些内容在实际开发能大幅度地减少代码量，提升打码的效率，学了之后便感觉这些知识挺实在的。
3.  虽然先前已经学过部分算法知识，可是我感觉这些思路和真正意义上的理解还是有所差别的，就有如我在对计数排序的实现的时候，总是找不准下一步实现的依据是什么，有时候感觉思路明朗，但也总会被某一步的实现给阻拦。
4.  在完善上周的c语言实现泛型的作业的时候，想着在最后输出的时候也按照原本输入的数据类型输出，可是总是找不到方法，最后根据数据类型地址长度的判断实现了这个功能，虽然有点投机取巧，可还是能够实现，内心有点小成就感。


## 存在问题
1. 时间分配不太合理，学习的时间和实际上手打码的时间相差太远，导致明明下一个知识点可以更加便利地完成功能，却总是在学习完一个基本知识点的时候就进行实操，感觉这样浪费了更多的时间和精力。
2. 感觉自己实现数据结构功能的时候逻辑思维并没有理清楚，往往都是一处错导致处处出错，以后要坚信先想一会再动手。
3. 比较浮躁，明明有能力做好的地方却会为了图方便而匆匆了事。一开始在做任务的时候只为了实现功能而写代码，感觉写出来的代码还是繁琐而无用，导致每次重构代码总是头大甚至无从下手。
4. 理论知识赶不上动手能力，每次写功能总感觉脑子里没有知识点，拼命赶上知识点进度的学习。

## 下周规划
1. 处理考核，学习与生活的关系，不可放弃，也不能成为一个无趣的机器人，要记住身边的美好
2. 抓紧理论知识的学习，把握时间去学习知识，前提是要理解掌握所学内容，不可匆匆了事。
3. 把握好学习与工作室上的时间和事务处理，在学习进度不掉失的情况下要专注去进行工作室的学习。
4. 劳逸结合，要经常去跑步锻炼身体，身体是革命的本钱。


